Revit 2026 API

# IFCParameterTemplateCopyTemplate Method

---

Create copy of mapping template with new name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCParameterTemplate CopyTemplate(
	Document document,
	string copyTemplateName
)
```
```vb
Public Function CopyTemplate (
	document As Document,
	copyTemplateName As String
) As IFCParameterTemplate
```
```cpp
public:
IFCParameterTemplate^ CopyTemplate(
	Document^ document,
	String^ copyTemplateName
)
```
```fsharp
member CopyTemplate :
        document : Document *
        copyTemplateName : string -> IFCParameterTemplate
```

#### Parameters

document Document
     The Revit document to save the copied template.
copyTemplateName String
     The name for copied template name.

#### Return Value

IFCParameterTemplate The copied mapping template element.

| Exception | Condition |
| --- | --- |
| ArgumentException | The name already exists. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Failed to create IFCParameterTemplate element. |

The copied template is saved in the document passed as parameter. Passing the same document as the source template's document will create a new template in the same document. The active template of the document remains unchanged.

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace